## Plan for org_account/billing_extract_tags
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_cloudwatch_event_target.billing_extract_tags`    |
|        | `aws_cloudwatch_log_group.billing_extract_tags`       |
|        | `aws_iam_policy.billing_extract_tags`                 |
|        | `aws_iam_role_policy_attachment.billing_extract_tags` |
|        | `aws_lambda_function.billing_extract_tags`            |
|        | `aws_lambda_permission.billing_extract_tags`          |
| update | `aws_s3_bucket_policy.billing_extract_tags`           |
|        | `module.billing_extract_tags.aws_s3_bucket.this`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.billing_extract_tags will be created
  + resource "aws_cloudwatch_event_target" "billing_extract_tags" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "billing_extract_tags_daily"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.billing_extract_tags will be created
  + resource "aws_cloudwatch_log_group" "billing_extract_tags" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/billing_extract_tags"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.billing_extract_tags will be created
  + resource "aws_iam_policy" "billing_extract_tags" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "BillingExtractTags"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:659087519042:*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:659087519042:log-group:/aws/lambda/billing_extract_tags:*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject*",
                          + "s3:ListBucket",
                          + "s3:GetObject*",
                          + "s3:GetBucketLocation",
                          + "s3:DeleteObject*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb/*",
                          + "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.billing_extract_tags will be created
  + resource "aws_iam_role_policy_attachment" "billing_extract_tags" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "BillingExtractTags"
    }

  # aws_lambda_function.billing_extract_tags will be created
  + resource "aws_lambda_function" "billing_extract_tags" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/main.py.zip"
      + function_name                  = "billing_extract_tags"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::659087519042:role/BillingExtractTags"
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "oKdEO6vgvvXn6bgDgo940IkMbjRRglD6jt7rCLrRcjI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TARGET_BUCKET" = "5bf89a78-1503-4e02-9621-3ac658f558fb"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.billing_extract_tags will be created
  + resource "aws_lambda_permission" "billing_extract_tags" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "billing_extract_tags"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:ca-central-1:659087519042:rule/billing_extract_tags_daily"
      + statement_id        = "AllowBillingExtractTagsDaily"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_policy.billing_extract_tags will be updated in-place
  ~ resource "aws_s3_bucket_policy" "billing_extract_tags" {
        id     = "5bf89a78-1503-4e02-9621-3ac658f558fb"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                          - "s3:GetBucketLocation",
                          - "s3:GetObject",
                          + "s3:PutObject*",
                            "s3:ListBucket",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListMultipartUploadParts",
                          - "s3:AbortMultipartUpload",
                          + "s3:GetObject*",
                          + "s3:GetBucketLocation",
                          + "s3:DeleteObject*",
                        ]
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::066023111852:root" -> "arn:aws:iam::659087519042:role/BillingExtractTags"
                        }
                      ~ Resource  = [
                          - "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb",
                            "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb/*",
                          + "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb",
                        ]
                      - Sid       = "CDSSupersetRootRead"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action    = [
                          + "s3:ListMultipartUploadParts",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066023111852:root"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb/*",
                          + "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.billing_extract_tags.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "5bf89a78-1503-4e02-9621-3ac658f558fb"
        tags                        = {
            "CostCentre" = "cds-aws-lz-production"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = true -> false

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.billing_extract_tags.aws_s3_bucket.this,
  on .terraform/modules/billing_extract_tags/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
